src/DataProcessors/ПроверкаИзмененийДатыОтгрузкиОбещанной/ПроверкаИзмененийДатыОтгрузкиОбещанной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПроверкаИзмененийДатыОтгрузкиОбещанной</name>
</mdclass:DataProcessor>

src/AccumulationRegisters/Долги/Долги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Долги</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/ИзменениеДатыОтгрузкиОбещанной/ИзменениеДатыОтгрузкиОбещанной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИзменениеДатыОтгрузкиОбещанной</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ДатаОтгрузкиОбещанная</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОтгрузкиНовая</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Причина</name>
    <type>
      <types>CatalogRef.ПричиныУвеличенияСроковПоставки</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЗНП</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ЗаказНаПроизводство/ЗаказНаПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказНаПроизводство</name>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <registerRecords>AccumulationRegister.ЗаказыНаПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.РезервированиеГП</registerRecords>
  <registerRecords>AccumulationRegister.Долги</registerRecords>
  <attributes>
    <name>НомерДокСбыт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокСбыт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КартаДоставки</name>
    <type>
      <types>CatalogRef.КартыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузкиОбещанная</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутренниеСчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТорговыйДом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СервисЦентр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтгрузки</name>
    <type>
      <types>EnumRef.ВидыОтгрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДоставки</name>
    <type>
      <types>EnumRef.ТипыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Понедельник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вторник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Среда</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Четверг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пятница</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Суббота</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Воскресенье</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаРазрешена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРассылки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаПоЗапросу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаказаФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВЭД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефоныКонтактногоЛица</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СДоверенностью</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьНаКого</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьСрок</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтраховочнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантСопровожденияОтгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбработанЛогистом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработкиЛогистом</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГодоваяДоверенность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейкаУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешняяПродукция</name>
    <type>
      <types>CatalogRef.Материалы</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВнешнейПродукции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказ</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВЗаказе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезервСвободныйОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезервПерепрогон</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокПоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КрупныйЗаказ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗапуска</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗапусков</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Изменена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РучнойЗапуск</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтгрузкиОбещанная</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВЭД_ВидДокумента</name>
      <type>
        <types>EnumRef.ВЭД_ВидДокумента</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокПоставкиТовара</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Тара</name>
    <attributes>
      <name>НомерТары</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/ПроверкаИзмененийДатыОтгрузкиОбещанной/Forms/Форма/Module.bsl
&НаСервере
Функция ПолучитьДолг(ЗНП,Товар)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДолгиОстатки.Продукция КАК Продукция,
	|	ДолгиОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.Долги.Остатки(&НаДату, ) КАК ДолгиОстатки
	|ГДЕ
	|	ДолгиОстатки.Документ = &Документ
	|	И ДолгиОстатки.Продукция.Товар = &Товар";
Запрос.УстановитьПараметр("НаДату",ТекущаяДата());
Запрос.УстановитьПараметр("Документ",ЗНП);
Запрос.УстановитьПараметр("Товар",Товар);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(ВыборкаДетальныеЗаписи.КоличествоОстаток);
	КонецЦикла;
	Возврат(0);
КонецФункции

&НаСервере
Процедура ПолучитьДанныеПоИзменениям(ТЧ)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИзменениеДатыОтгрузкиОбещанной.ДатаОтгрузкиОбещанная КАК ДатаОтгрузкиОбещанная,
	|	ИзменениеДатыОтгрузкиОбещанной.ДатаОтгрузкиНовая КАК ДатаОтгрузкиНовая,
	|	ИзменениеДатыОтгрузкиОбещанной.Период КАК Период
	|ИЗ
	|	РегистрСведений.ИзменениеДатыОтгрузкиОбещанной КАК ИзменениеДатыОтгрузкиОбещанной
	|ГДЕ
	|	ИзменениеДатыОтгрузкиОбещанной.ЗНП = &ЗНП
	|	И ИзменениеДатыОтгрузкиОбещанной.Товар = &Товар
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
Запрос.УстановитьПараметр("ЗНП",ТЧ.ЗНП);
Запрос.УстановитьПараметр("Товар",ТЧ.Товар);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
флПервая = Ложь;
КоличествоИзменений = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Не флПервая Тогда
		ТЧ.ДатаОтгрузкиПервая = ВыборкаДетальныеЗаписи.ДатаОтгрузкиОбещанная;
	    флПервая = Истина;
		КонецЕсли;
	КоличествоИзменений = КоличествоИзменений + 1;
	КонецЦикла;
ТЧ.КоличествоИзменений = КоличествоИзменений;
КонецПроцедуры

&НаСервере
Функция ПолучитьГрафикОтгрузки(ЗНП)
ГрафикОтгрузки = "";
	Если ЗНП.Понедельник Тогда
	ГрафикОтгрузки = ГрафикОтгрузки+"ПН;";	
	КонецЕсли; 
	Если ЗНП.Вторник Тогда
	ГрафикОтгрузки = ГрафикОтгрузки+"ВТ;";	
	КонецЕсли;
	Если ЗНП.Среда Тогда
	ГрафикОтгрузки = ГрафикОтгрузки+"СР;";	
	КонецЕсли;
	Если ЗНП.Четверг Тогда
	ГрафикОтгрузки = ГрафикОтгрузки+"ЧТ;";	
	КонецЕсли;
	Если ЗНП.Пятница Тогда
	ГрафикОтгрузки = ГрафикОтгрузки+"ПТ;";	
	КонецЕсли;
	Если ЗНП.Суббота Тогда
	ГрафикОтгрузки = ГрафикОтгрузки+"СБ;";	
	КонецЕсли;
	Если ЗНП.Воскресенье Тогда
	ГрафикОтгрузки = ГрафикОтгрузки+"ВС;";	
	КонецЕсли;
Возврат(ГрафикОтгрузки);
КонецФункции

&НаСервере
Процедура ПолучитьИзмененияНаСервере()
ТаблицаИзменений.Очистить();
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИзменениеДатыОтгрузкиОбещаннойСрезПоследних.Период КАК Период,
	|	ИзменениеДатыОтгрузкиОбещаннойСрезПоследних.ЗНП КАК ЗНП,
	|	ИзменениеДатыОтгрузкиОбещаннойСрезПоследних.Товар КАК Товар,
	|	ИзменениеДатыОтгрузкиОбещаннойСрезПоследних.ДатаОтгрузкиОбещанная КАК ДатаОтгрузкиОбещанная,
	|	ИзменениеДатыОтгрузкиОбещаннойСрезПоследних.ДатаОтгрузкиНовая КАК ДатаОтгрузкиНовая,
	|	ИзменениеДатыОтгрузкиОбещаннойСрезПоследних.Причина КАК Причина
	|ИЗ
	|	РегистрСведений.ИзменениеДатыОтгрузкиОбещанной.СрезПоследних(&НаДату, ) КАК ИзменениеДатыОтгрузкиОбещаннойСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство.Заказ КАК ЗаказНаПроизводствоЗаказ
	|		ПО ИзменениеДатыОтгрузкиОбещаннойСрезПоследних.ЗНП = ЗаказНаПроизводствоЗаказ.Ссылка
	|			И ИзменениеДатыОтгрузкиОбещаннойСрезПоследних.Товар = ЗаказНаПроизводствоЗаказ.Товар
	|ГДЕ
	|	ИзменениеДатыОтгрузкиОбещаннойСрезПоследних.ДатаОтгрузкиОбещанная МЕЖДУ &ДатаНач И &ДатаКон
	|	И ИзменениеДатыОтгрузкиОбещаннойСрезПоследних.ДатаОбработки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
	Если ВидПродукции = 1 Тогда
	Запрос.Текст = Запрос.Текст + " И ТипЗначения(ЗаказНаПроизводствоЗаказ.Продукция) = Тип(Справочник.Номенклатура)";	
	ИначеЕсли ВидПродукции = 2 Тогда	
	Запрос.Текст = Запрос.Текст + " И ТипЗначения(ЗаказНаПроизводствоЗаказ.Продукция) = Тип(Справочник.Материалы)";	
	КонецЕсли; 
Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО
								|	ИзменениеДатыОтгрузкиОбещаннойСрезПоследних.ЗНП.Контрагент.Наименование,
								|	ИзменениеДатыОтгрузкиОбещаннойСрезПоследних.ЗНП.Номер";
Запрос.УстановитьПараметр("НаДату",ТекущаяДата());
Запрос.УстановитьПараметр("ДатаНач",Период.ДатаНачала);
Запрос.УстановитьПараметр("ДатаКон",Период.ДатаОкончания);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ТЧ = ТаблицаИзменений.Добавить();
	ТЧ.Период = ВыборкаДетальныеЗаписи.Период;
	ТЧ.Контрагент = ВыборкаДетальныеЗаписи.ЗНП.Контрагент;
	ТЧ.ЗНП = ВыборкаДетальныеЗаписи.ЗНП;
	ТЧ.Товар = ВыборкаДетальныеЗаписи.Товар;
	ТЧ.Количество = ПолучитьДолг(ВыборкаДетальныеЗаписи.ЗНП,ВыборкаДетальныеЗаписи.Товар);
	ТЧ.ДатаОтгрузкиОбещанная = ВыборкаДетальныеЗаписи.ДатаОтгрузкиОбещанная;
	ТЧ.ДатаОтгрузкиНовая = ВыборкаДетальныеЗаписи.ДатаОтгрузкиНовая;
	ТЧ.Причина = ВыборкаДетальныеЗаписи.Причина;
	ПолучитьДанныеПоИзменениям(ТЧ);
		Если ТЧ.ЗНП.ОтгрузкаПоЗапросу Тогда
		ТЧ.ГрафикОтгрузки = "по запросу";
		Иначе			
		ТЧ.ГрафикОтгрузки = ПолучитьГрафикОтгрузки(ТЧ.ЗНП);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИзменения(Команда)
ПолучитьИзмененияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗавершитьОбработкуНаСервере()
	Для каждого ТЧ Из ТаблицаИзменений Цикл
		Если ТЧ.Пометка Тогда
		ИДО = РегистрыСведений.ИзменениеДатыОтгрузкиОбещанной.СоздатьМенеджерЗаписи();
		ИДО.Период = ТЧ.Период;
		ИДО.ЗНП = ТЧ.ЗНП;
		ИДО.Товар = ТЧ.Товар;
		ИДО.ДатаОтгрузкиОбещанная = ТЧ.ДатаОтгрузкиОбещанная;
		ИДО.ДатаОтгрузкиНовая = ТЧ.ДатаОтгрузкиНовая;
		ИДО.Причина = ТЧ.Причина;
		ИДО.ДатаОбработки = ТекущаяДата();
		ИДО.Записать(Истина);
		КонецЕсли; 
	КонецЦикла;
ПолучитьИзмененияНаСервере(); 
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьОбработку(Команда)
ЗавершитьОбработкуНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокКонтрагентов()
СписокКонтрагентов = Новый СписокЗначений;

	Для каждого ТЧ Из ТаблицаИзменений Цикл
		Если СписокКонтрагентов.НайтиПоЗначению(ТЧ.ЗНП.Контрагент) = Неопределено Тогда
		СписокКонтрагентов.Добавить(ТЧ.ЗНП.Контрагент);
		КонецЕсли; 
	КонецЦикла;
Возврат(СписокКонтрагентов);
КонецФункции

&НаСервере
Функция ПечатьКонтрагента(Контрагент)
ТабДок = Новый ТабличныйДокумент;
Результат = Новый Структура("ТД,Пустой",ТабДок,Истина);

ОбъектЗн = РеквизитФормыВЗначение("Объект");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблТовар = Макет.ПолучитьОбласть("Товар");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.Контрагент = Контрагент;
ТабДок.Вывести(ОблШапка);
	Для каждого ТЧ Из ТаблицаИзменений Цикл
		Если ТЧ.Пометка Тогда
			Если ТЧ.ЗНП.Контрагент = Контрагент Тогда
			ОблТовар.Параметры.Счёт = ТЧ.ЗНП.Номер;
			ОблТовар.Параметры.Товар = ТЧ.Товар;
			ОблТовар.Параметры.Количество = ТЧ.Количество;
			ОблТовар.Параметры.ДатаОтгрузки = ТЧ.ДатаОтгрузкиНовая;
			ОблТовар.Параметры.Причина = ТЧ.Причина;
			ТабДок.Вывести(ОблТовар);
			Результат.Пустой = Ложь;
			КонецЕсли;
		КонецЕсли;  
	КонецЦикла;	
ТабДок.Вывести(ОблКонец);
Возврат(Результат);
КонецФункции

&НаКлиенте
Процедура Печать(Команда)
СписокКонтрагентов = ПолучитьСписокКонтрагентов();
	Для каждого Контрагент Из СписокКонтрагентов Цикл
	Результат = ПечатьКонтрагента(Контрагент.Значение);
		Если Не Результат.Пустой Тогда
		Результат.ТД.Показать("Изменения для "+Контрагент.Значение);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ВыбратьВсеНаСервере()
	Для каждого ТЧ Из ТаблицаИзменений Цикл
		Если СписокТоваров.Количество() > 0 Тогда
			Если СписокТоваров.НайтиПоЗначению(ТЧ.Товар) <> Неопределено Тогда
			Продолжить;
			КонецЕсли; 		
		КонецЕсли; 
	ТЧ.Пометка = Истина;
	КонецЦикла; 	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
ВыбратьВсеНаСервере();	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	Для каждого ТЧ Из ТаблицаИзменений Цикл
	ТЧ.Пометка = Ложь;
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Функция ПроверитьВИсключениях(Товар)
	Если СписокТоваров.Количество() > 0 Тогда
		Если СписокТоваров.НайтиПоЗначению(Товар) <> Неопределено Тогда
		Возврат(Ложь);
		КонецЕсли; 		
	КонецЕсли;	
Возврат(Истина);
КонецФункции

&НаКлиенте
Процедура ТаблицаИзмененийПометкаПриИзменении(Элемент)
	Если Элементы.ТаблицаИзменений.ТекущиеДанные.Пометка = Истина Тогда
	Элементы.ТаблицаИзменений.ТекущиеДанные.Пометка = ПроверитьВИсключениях(Элементы.ТаблицаИзменений.ТекущиеДанные.Товар);
	КонецЕсли; 
КонецПроцедуры
